src/testsuite/sysbench/results/oltp_insert.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 862.89 qps: 862.89 (r/w/o: 0.00/862.89/0.00) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 921.90 qps: 921.90 (r/w/o: 0.00/921.90/0.00) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 713.70 qps: 713.70 (r/w/o: 0.00/713.70/0.00) lat (ms,95%): 419.45 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           51345
        other:                           0
        total:                           51345
    transactions:                        51345  (855.12 per sec.)
    queries:                             51345  (855.12 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      855.1182
    time elapsed:                        60.0457s
    total number of events:              51345

Latency (ms):
         min:                                   41.15
         avg:                                  149.80
         max:                                  897.88
         95th percentile:                      257.95
         sum:                              7691234.16

Threads fairness:
    events (avg/stddev):           401.1328/3.25
    execution time (avg/stddev):   60.0878/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 868.33 qps: 868.33 (r/w/o: 0.00/868.33/0.00) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 930.80 qps: 930.80 (r/w/o: 0.00/930.80/0.00) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 937.40 qps: 937.40 (r/w/o: 0.00/937.40/0.00) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           55188
        other:                           0
        total:                           55188
    transactions:                        55188  (919.13 per sec.)
    queries:                             55188  (919.13 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      919.1338
    time elapsed:                        60.0450s
    total number of events:              55188

Latency (ms):
         min:                                   38.03
         avg:                                  139.35
         max:                                 1242.77
         95th percentile:                      231.53
         sum:                              7690370.27

Threads fairness:
    events (avg/stddev):           431.1562/3.38
    execution time (avg/stddev):   60.0810/0.00